<!DOCTYPE html>
<html lang="vi">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>HSK5 Learning App</title>

<style>

:root{
    --bg-gradient: linear-gradient(135deg,#ff758c,#ff7eb3);
    --container-bg: white;
    --text-color: #222;
    --button-bg: #ff4f81;
    --input-bg: white;
}

body.dark{
    --bg-gradient: linear-gradient(135deg,#1e1e1e,#2c2c2c);
    --container-bg: #2f2f2f;
    --text-color: #f1f1f1;
    --button-bg: #ff6b9a;
    --input-bg: #444;
}

body{
    font-family: Arial, sans-serif;
    background: var(--bg-gradient);
    display:flex;
    justify-content:center;
    align-items:flex-start;
    min-height:100vh;
    margin:0;
    padding:20px 10px;
    box-sizing:border-box;
    transition:0.3s;
}

.container{
    background: var(--container-bg);
    color: var(--text-color);
    width:100%;
    max-width:750px;
    padding:20px;
    border-radius:20px;
    box-shadow:0 10px 30px rgba(0,0,0,0.2);
    text-align:center;
    position:relative;
    transition:0.3s;
}

.dark-toggle{
    position:absolute;
    top:15px;
    right:15px;
    cursor:pointer;
    font-size:18px;
}

button{
    padding:10px 14px;
    margin:6px 4px;
    border:none;
    border-radius:10px;
    cursor:pointer;
    background:var(--button-bg);
    color:white;
    font-weight:bold;
    font-size:14px;
}

button:hover{ opacity:0.85; }

input{
    padding:12px;
    width:100%;
    margin:10px 0;
    border-radius:10px;
    border:1px solid #ccc;
    font-size:16px;
    background:var(--input-bg);
    color:var(--text-color);
    box-sizing:border-box;
}

.question{
    font-size:26px;
    margin:20px 0;
    word-break:break-word;
}

.result{
    font-weight:bold;
    margin-top:15px;
    font-size:16px;
}

.list-container{
    max-height:60vh;
    overflow-y:auto;
    text-align:left;
    margin-top:10px;
    border-top:1px solid #ddd;
    padding-top:10px;
}

.list-item{
    padding:8px 0;
    border-bottom:1px solid #eee;
}

@media (max-width:600px){
    button{
        width:100%;
        margin:6px 0;
    }
    .question{
        font-size:22px;
    }
}

</style>
</head>

<body>

<div class="container">
<div class="dark-toggle" onclick="toggleDark()">🌙</div>

<h2>HSK5 Practice</h2>

<div id="menu">
    <button onclick="startMode(1,false)">Nhận mặt chữ</button>
    <button onclick="startMode(2,false)">Việt → Trung</button>
    <button onclick="startWrongQuiz()">🔥 Quiz từ sai</button>
    <button onclick="showList()">Danh sách từ vựng</button>
    <button onclick="showWrongList()">⭐ Ôn lại từ sai</button>
</div>

<div id="quiz" style="display:none;">

    <div class="question" id="question"></div>

    <!-- NÚT PHÁT ÂM -->
    <button onclick="speakChinese()">🔊 Nghe phát âm</button>

    <div id="inputArea"></div>

    <button onclick="checkAnswer()">Kiểm tra</button>
    <button onclick="loadQuestion()">Next</button>
    <button onclick="goBack()">Menu</button>

    <div class="result" id="result"></div>
</div>

<div id="listMode" style="display:none;">
    <button onclick="goBack()">Menu</button>

    <input type="text" id="searchInput"
           placeholder="🔎 Tìm theo tiếng Trung, pinyin hoặc nghĩa..."
           onkeyup="searchVocab()">

    <div class="list-container" id="listContainer"></div>
</div>

</div>

<script>

let vocab = [];
let current = {};
let mode = 1;
let quizWrongOnly = false;

let wrongWords = JSON.parse(localStorage.getItem("wrongWords")) || [];
let darkMode = localStorage.getItem("darkMode") === "true";

if(darkMode){
    document.body.classList.add("dark");
}

function toggleDark(){
    document.body.classList.toggle("dark");
    localStorage.setItem("darkMode",
        document.body.classList.contains("dark"));
}

/* ===== PHÁT ÂM ===== */
function speakChinese(){
    if(!current.chinese) return;

    const utterance = new SpeechSynthesisUtterance(current.chinese);
    utterance.lang = "zh-CN";
    utterance.rate = 0.9;
    speechSynthesis.speak(utterance);
}

/* ===== LOAD DATA ===== */
fetch("hsk5_vocab.json")
.then(res => res.json())
.then(data => { vocab = data; });

function startMode(m, wrongOnly){
    mode = m;
    quizWrongOnly = wrongOnly;
    document.getElementById("menu").style.display="none";
    document.getElementById("quiz").style.display="block";
    loadQuestion();
}

function startWrongQuiz(){
    if(wrongWords.length === 0){
        alert("Chưa có từ sai!");
        return;
    }
    mode = 1;
    quizWrongOnly = true;
    document.getElementById("menu").style.display="none";
    document.getElementById("quiz").style.display="block";
    loadQuestion();
}

function loadQuestion(){
    document.getElementById("result").innerText="";
    let source = quizWrongOnly ? wrongWords : vocab;
    current = source[Math.floor(Math.random()*source.length)];
    renderQuestion();
}

function renderQuestion(){
    const q = document.getElementById("question");
    const input = document.getElementById("inputArea");

    if(mode===1){
        q.innerText = current.chinese;
        input.innerHTML = `
            <input id="pinyin" placeholder="Nhập pinyin">
            <input id="meaning" placeholder="Nhập nghĩa tiếng Việt">
        `;
    }

    if(mode===2){
        q.innerText = current.vietnamese;
        input.innerHTML = `
            <input id="chinese" placeholder="Nhập tiếng Trung">
        `;
    }
}

function checkAnswer(){
    document.getElementById("result").innerText =
        `${current.chinese} (${current.pinyin}) - ${current.vietnamese}`;
}

function goBack(){
    document.getElementById("quiz").style.display="none";
    document.getElementById("listMode").style.display="none";
    document.getElementById("menu").style.display="block";
}

function showList(){
    document.getElementById("menu").style.display="none";
    document.getElementById("listMode").style.display="block";
    renderList(vocab);
}

function showWrongList(){
    document.getElementById("menu").style.display="none";
    document.getElementById("listMode").style.display="block";
    renderList(wrongWords);
}

function renderList(data){
    const container = document.getElementById("listContainer");
    container.innerHTML="";
    data.forEach((item,index)=>{
        const div = document.createElement("div");
        div.className="list-item";
        div.innerHTML =
            `<b>${index+1}. ${item.chinese}</b>
             (${item.pinyin}) - ${item.vietnamese}`;
        container.appendChild(div);
    });
}

function searchVocab(){
    const keyword = document.getElementById("searchInput").value.toLowerCase();
    const filtered = vocab.filter(item =>
        item.chinese.includes(keyword) ||
        item.pinyin.toLowerCase().includes(keyword) ||
        item.vietnamese.toLowerCase().includes(keyword)
    );
    renderList(filtered);
}

</script>

</body>
</html>
